{
  "timestamp": "2025-09-10T06:17:52.614796",
  "english": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; max-width: 600px; margin: 0 auto; padding: 15px; background-color: #f9f9f9; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1);\">\n    <h2 style=\"color: #333; border-bottom: 2px solid #e0e0e0; padding-bottom: 10px;\">Kledering Weather Report - 2025-09-10</h2>\n\n    <p><strong>Temperature:</strong> Mild with a range of <strong>16.6°C to 20.1°C</strong>. Apparent temperatures remain close to actual, with minimal wind chill effect.</p>\n\n    <p><strong>Wind:</strong> Moderate to strong winds (avg. <strong>10.2 km/h</strong>, gusts up to <strong>31.3 km/h</strong>) from variable directions, strongest in the afternoon. Wind speeds may impact cycling or running, especially in open areas.</p>\n\n    <p><strong>Precipitation:</strong> Heavy rainfall (<strong>28.7 mm</strong>) with <strong>100% probability</strong> during most of the day. Avoid outdoor activities due to persistent rain and poor visibility (<strong>14.6 km avg</strong>).</p>\n\n    <p><strong>UV Index:</strong> Low (<strong>max 3.9</strong>), but minimal sunshine (<strong>0 hours</strong>) due to overcast conditions (100% cloud cover). UV exposure is negligible.</p>\n\n    <p><strong>Outdoor Activity Suggestion:</strong> <strong>Not suitable</strong> for outdoor sports due to heavy rain, strong winds, and poor visibility. If necessary, early morning (7-9 AM) may offer slightly lighter rain, but conditions remain unfavorable.</p>\n\n    <p><strong>Weather Pattern:</strong> Overcast and rainy throughout the day with no significant breaks. Wind speeds increase in the afternoon, compounding discomfort for outdoor activities.</p>\n</div>",
  "german": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; max-width: 600px; margin: 0 auto; padding: 15px; background-color: #f9f9f9; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1);\">\n    <h2 style=\"color: #333; border-bottom: 2px solid #e0e0e0; padding-bottom: 10px;\">Kledering Wetterbericht - 2025-09-10</h2>\n\n    <p><strong>Temperatur:</strong> Mild mit einem Bereich von <strong>16.6°C bis 20.1°C</strong>. Die gefühlte Temperatur bleibt nahe der tatsächlichen, mit minimalem Windchill-Effekt.</p>\n\n    <p><strong>Wind:</strong> Mäßige bis starke Winde (Durchschnitt <strong>10.2 km/h</strong>, Böen bis zu <strong>31.3 km/h</strong>) aus wechselnden Richtungen, am stärksten am Nachmittag. Die Windgeschwindigkeiten können Radfahren oder Laufen beeinträchtigen, insbesondere in offenen Gebieten.</p>\n\n    <p><strong>Niederschlag:</strong> Starkregen (<strong>28.7 mm</strong>) mit <strong>100% Wahrscheinlichkeit</strong> für den größten Teil des Tages. Vermeiden Sie Outdoor-Aktivitäten aufgrund anhaltenden Regens und schlechter Sicht (<strong>14.6 km im Durchschnitt</strong>).</p>\n\n    <p><strong>UV-Index:</strong> Niedrig (<strong>max 3.9</strong>), aber minimale Sonneneinstrahlung (<strong>0 Stunden</strong>) aufgrund bewölkter Bedingungen (100% Bewölkung). Die UV-Strahlung ist vernachlässigbar.</p>\n\n    <p><strong>Empfehlung für Outdoor-Aktivitäten:</strong> <strong>Nicht geeignet</strong> für Outdoor-Sportarten aufgrund von Starkregen, starken Winden und schlechter Sicht. Falls notwendig, könnte der frühe Morgen (7-9 Uhr) etwas leichteren Regen bieten, aber die Bedingungen bleiben ungünstig.</p>\n\n    <p><strong>Wetterlage:</strong> Bewölkt und regnerisch den ganzen Tag über ohne nennenswerte Unterbrechungen. Die Windgeschwindigkeiten nehmen am Nachmittag zu, was den Aufenthalt im Freien zusätzlich unangenehm macht.</p>\n</div>"
}