{
  "timestamp": "2025-08-22T06:18:42.207865",
  "english": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 1px solid #eee; padding-bottom: 5px;\">Kledering Weather Report - 2025-08-22</h2>\n\n    <p><strong>Temperature:</strong> Ranges from <strong>17.4°C to 23.7°C</strong>, with a peak in the early afternoon. Apparent temperatures remain comfortable, though slightly cooler in the early morning (15.6°C).</p>\n\n    <p><strong>Wind:</strong> Moderate northwest winds (avg. 14.9 km/h, gusts up to 44.6 km/h) persist, strongest between 10 AM and 3 PM. Gusts may affect cycling or running, especially in exposed areas.</p>\n\n    <p><strong>Precipitation:</strong> Light early-morning showers (<strong>1.0 mm total</strong>) with 100% cloud cover before 10 AM. No further rain expected.</p>\n\n    <p><strong>UV Index:</strong> Peaks at <strong>5.9 (Moderate-High)</strong> between 12 PM and 2 PM. Sun protection recommended during this period.</p>\n\n    <p><strong>Visibility & Clouds:</strong> Overcast until late morning, clearing gradually. Visibility remains good (avg. 51.9 km).</p>\n\n    <h3 style=\"color: #2c3e50; margin-top: 15px;\">Outdoor Activity Recommendations</h3>\n    <ul style=\"padding-left: 20px;\">\n        <li><strong>Morning (7-9 AM):</strong> Cool and breezy, but improving conditions. Ideal for running or cycling after 8 AM as winds ease slightly.</li>\n        <li><strong>Afternoon (4-8 PM):</strong> Warmest period with moderate UV. Best for outdoor sports after 5 PM when UV decreases and winds calm.</li>\n        <li><strong>Avoid:</strong> Early morning (before 8 AM) due to rain and strong winds.</li>\n    </ul>\n\n    <p><strong>Note:</strong> Wind gusts may require adjustments for cyclists, and sunscreen is advised during peak UV hours.</p>\n</div>",
  "german": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 1px solid #eee; padding-bottom: 5px;\">Kledering Wetterbericht - 2025-08-22</h2>\n\n    <p><strong>Temperatur:</strong> Schwankt zwischen <strong>17.4°C bis 23.7°C</strong>, mit einem Höchststand am frühen Nachmittag. Die gefühlte Temperatur bleibt angenehm, wenn auch etwas kühler am frühen Morgen (15.6°C).</p>\n\n    <p><strong>Wind:</strong> Mäßige Nordwestwinde (Durchschnitt 14.9 km/h, Böen bis 44.6 km/h) halten an, am stärksten zwischen 10 Uhr und 15 Uhr. Böen können Radfahren oder Laufen beeinträchtigen, besonders in exponierten Gebieten.</p>\n\n    <p><strong>Niederschlag:</strong> Leichte Morgenregen (<strong>1.0 mm Gesamtmenge</strong>) mit 100% Bewölkung vor 10 Uhr. Kein weiterer Regen erwartet.</p>\n\n    <p><strong>UV-Index:</strong> Erreicht <strong>5.9 (Mäßig-Hoch)</strong> zwischen 12 Uhr und 14 Uhr. Sonnenschutz wird während dieser Zeit empfohlen.</p>\n\n    <p><strong>Sichtweite & Wolken:</strong> Bewölkt bis zum späten Vormittag, allmählich aufklarend. Die Sicht bleibt gut (Durchschnitt 51.9 km).</p>\n\n    <h3 style=\"color: #2c3e50; margin-top: 15px;\">Empfehlungen für Outdoor-Aktivitäten</h3>\n    <ul style=\"padding-left: 20px;\">\n        <li><strong>Vormittag (7-9 Uhr):</strong> Kühl und windig, aber sich verbessernde Bedingungen. Ideal zum Laufen oder Radfahren ab 8 Uhr, wenn der Wind etwas nachlässt.</li>\n        <li><strong>Nachmittag (16-20 Uhr):</strong> Wärmste Zeit mit mäßigem UV-Index. Am besten für Outdoor-Sport nach 17 Uhr, wenn der UV-Index sinkt und der Wind nachlässt.</li>\n        <li><strong>Vermeiden:</strong> Früher Morgen (vor 8 Uhr) aufgrund von Regen und starken Winden.</li>\n    </ul>\n\n    <p><strong>Hinweis:</strong> Windböen können Anpassungen für Radfahrer erfordern, und Sonnencreme wird während der Spitzen-UV-Stunden empfohlen.</p>\n</div>"
}