{
  "timestamp": "2026-01-10T06:19:30.024765",
  "english": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 2px solid #3498db; padding-bottom: 5px;\">Kledering Weather Report - January 10, 2026</h2>\n\n    <p><strong>Temperature:</strong> Cold, ranging from -5.9°C to -1.4°C with apparent temperatures as low as -10.7°C due to wind chill. Morning and evening hours are particularly frigid.</p>\n\n    <p><strong>Wind:</strong> Moderate to strong winds (avg. 8 km/h, gusts up to 33.5 km/h) from variable directions, strongest in the afternoon. Wind chill significantly lowers perceived temperatures.</p>\n\n    <p><strong>Precipitation:</strong> Light snow showers possible (0.9 mm total, 95% probability in the late afternoon). Visibility remains fair (avg. 21.5 km) despite overcast conditions.</p>\n\n    <p><strong>UV Index:</strong> Low (max 1.2), with brief sunshine (2.9 hours total). Cloud cover remains high (73-100%) throughout the day.</p>\n\n    <h3 style=\"color: #e74c3c;\">Outdoor Activity Recommendations</h3>\n    <p><strong>Morning (7-9 AM):</strong> Extremely cold with apparent temperatures near -9°C. Avoid prolonged exposure; dress in layers and protect extremities.</p>\n    <p><strong>Afternoon (12-3 PM):</strong> Slightly milder but windy. Best window for activity, though wind chill remains a factor. Monitor for late-afternoon snow showers.</p>\n    <p><strong>Evening (4-8 PM):</strong> Rapidly cooling with high wind chill and precipitation risk. Not ideal for outdoor sports.</p>\n\n    <p style=\"font-style: italic; color: #7f8c8d;\">Note: Frostbite risk is elevated due to sustained sub-zero temperatures and wind exposure. Check real-time conditions before heading out.</p>\n</div>",
  "german": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 2px solid #3498db; padding-bottom: 5px;\">Kledering Wetterbericht - 10. Januar 2026</h2>\n\n    <p><strong>Temperatur:</strong> Kalt, im Bereich von -5,9°C bis -1,4°C mit gefühlten Temperaturen bis -10,7°C durch Windchill. Morgens und abends ist es besonders eisig.</p>\n\n    <p><strong>Wind:</strong> Mäßige bis starke Winde (Durchschnitt 8 km/h, Böen bis 33,5 km/h) aus wechselnden Richtungen, am stärksten am Nachmittag. Der Windchill senkt die gefühlte Temperatur deutlich.</p>\n\n    <p><strong>Niederschlag:</strong> Leichte Schneeschauer möglich (0,9 mm insgesamt, 95% Wahrscheinlichkeit am späten Nachmittag). Die Sicht bleibt trotz bewölktem Himmel gut (Durchschnitt 21,5 km).</p>\n\n    <p><strong>UV-Index:</strong> Niedrig (Maximal 1,2), mit kurzer Sonneneinstrahlung (2,9 Stunden insgesamt). Die Bewölkung bleibt den ganzen Tag hoch (73-100%).</p>\n\n    <h3 style=\"color: #e74c3c;\">Empfehlungen für Outdoor-Aktivitäten</h3>\n    <p><strong>Vormittag (7-9 Uhr):</strong> Extrem kalt mit gefühlten Temperaturen nahe -9°C. Vermeiden Sie längeren Aufenthalt im Freien; tragen Sie mehrere Schichten und schützen Sie die Extremitäten.</p>\n    <p><strong>Nachmittag (12-15 Uhr):</strong> Etwas milder, aber windig. Beste Zeit für Aktivitäten, obwohl der Windchill ein Faktor bleibt. Achten Sie auf Schneeschauer am späten Nachmittag.</p>\n    <p><strong>Abend (16-20 Uhr):</strong> Schnell abkühlend mit hohem Windchill und Niederschlagsrisiko. Nicht ideal für Outdoor-Sport.</p>\n\n    <p style=\"font-style: italic; color: #7f8c8d;\">Hinweis: Das Risiko von Erfrierungen ist aufgrund anhaltender Temperaturen unter Null und Windbelastung erhöht. Überprüfen Sie die aktuellen Bedingungen, bevor Sie das Haus verlassen.</p>\n</div>"
}