{
  "timestamp": "2025-11-25T06:20:25.431725",
  "english": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 2px solid #3498db; padding-bottom: 5px;\">Kledering Weather Report - 2025-11-25</h2>\n\n    <p><strong>Temperature:</strong> Cold with a range of <strong>1.7°C to 4.6°C</strong>. Apparent temperatures feel colder, especially in the early morning and evening (as low as -2.1°C).</p>\n\n    <p><strong>Wind:</strong> Moderate to strong winds (avg. 9.5 km/h, gusts up to 32 km/h) from the northwest, increasing in the afternoon. Wind chill will make outdoor activities feel colder.</p>\n\n    <p><strong>Precipitation:</strong> Light rain expected (3.7 mm total), with the highest probability (73%) in the mid-afternoon. Overcast skies persist throughout the day.</p>\n\n    <p><strong>UV Index:</strong> Very low (max 0.7), with minimal sunshine (0.3 hours total). No significant UV exposure risk.</p>\n\n    <p><strong>Outdoor Activity Suggestion:</strong>\n        <ul>\n            <li><strong>Morning (7-9 AM):</strong> Cold with light winds. Avoid if sensitive to wind chill.</li>\n            <li><strong>Afternoon (4-6 PM):</strong> Stronger winds and rain likely. Not ideal for outdoor sports.</li>\n            <li><strong>Evening (6-8 PM):</strong> Windy and cold. Layered clothing recommended if venturing out.</li>\n        </ul>\n        <p>Overall, conditions are <strong>not favorable</strong> for outdoor activities due to cold temperatures, wind, and rain.</p>\n    </p>\n</div>",
  "german": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; color: #333; max-width: 600px; margin: 0 auto; padding: 10px;\">\n    <h2 style=\"color: #2c3e50; border-bottom: 2px solid #3498db; padding-bottom: 5px;\">Kledering Wetterbericht - 2025-11-25</h2>\n\n    <p><strong>Temperatur:</strong> Kalt mit einem Bereich von <strong>1.7°C bis 4.6°C</strong>. Die gefühlte Temperatur wirkt kälter, besonders am frühen Morgen und Abend (bis zu -2.1°C).</p>\n\n    <p><strong>Wind:</strong> Mäßige bis starke Winde (Durchschnitt 9.5 km/h, Böen bis 32 km/h) aus nordwestlicher Richtung, die am Nachmittag zunehmen. Der Windchill-Effekt lässt Outdoor-Aktivitäten kälter wirken.</p>\n\n    <p><strong>Niederschlag:</strong> Leichter Regen erwartet (3.7 mm insgesamt), mit der höchsten Wahrscheinlichkeit (73%) am Mittag. Bewölkter Himmel bleibt den ganzen Tag über bestehen.</p>\n\n    <p><strong>UV-Index:</strong> Sehr niedrig (max 0.7), mit minimaler Sonneneinstrahlung (0.3 Stunden insgesamt). Kein signifikantes UV-Expositionsrisiko.</p>\n\n    <p><strong>Empfehlung für Outdoor-Aktivitäten:</strong>\n        <ul>\n            <li><strong>Vormittag (7-9 Uhr):</strong> Kalt mit leichten Winden. Vermeiden, wenn empfindlich gegenüber Windchill.</li>\n            <li><strong>Nachmittag (16-18 Uhr):</strong> Stärkere Winde und Regen wahrscheinlich. Nicht ideal für Outdoor-Sportarten.</li>\n            <li><strong>Abend (18-20 Uhr):</strong> Windig und kalt. Mehrschichtige Kleidung wird empfohlen, wenn man nach draußen geht.</li>\n        </ul>\n        <p>Insgesamt sind die Bedingungen <strong>nicht günstig</strong> für Outdoor-Aktivitäten aufgrund der kalten Temperaturen, des Windes und des Regens.</p>\n    </p>\n</div>"
}