{
  "timestamp": "2025-12-30T06:21:15.964980",
  "english": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; max-width: 600px; margin: 0 auto; padding: 15px; background-color: #f9f9f9; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1);\">\n    <h2 style=\"color: #333; border-bottom: 1px solid #ddd; padding-bottom: 10px;\">Kledering Weather Report - 2025-12-30</h2>\n\n    <p><strong>Temperature:</strong> Ranges from -0.9°C to 2.2°C, with apparent temperatures as low as -7.5°C due to strong winds. Morning and evening hours will feel particularly cold.</p>\n\n    <p><strong>Wind:</strong> Strong westerly winds averaging 23.3 km/h, with gusts up to 54 km/h. Wind chill will significantly impact perceived temperatures, especially in the early morning and late evening.</p>\n\n    <p><strong>Precipitation:</strong> Minimal precipitation (0.2 mm) expected, with a brief 78% chance of light rain or drizzle around 7 AM. Otherwise, dry conditions prevail.</p>\n\n    <p><strong>UV Index:</strong> Peaks at 1.5 during midday, indicating low UV exposure. Sun protection is not critical, but sunglasses may be useful for outdoor activities.</p>\n\n    <p><strong>Cloud Cover:</strong> Overcast in the early morning, clearing by midday and remaining mostly clear until late evening. Visibility remains excellent at 58.9 km on average.</p>\n\n    <h3 style=\"color: #333; margin-top: 15px;\">Outdoor Activity Recommendations</h3>\n    <p><strong>Morning (7-9 AM):</strong> Unfavorable due to cold wind chill (-6.3°C to -5.0°C) and potential light precipitation. Avoid outdoor sports during this window.</p>\n    <p><strong>Afternoon (12-4 PM):</strong> Ideal conditions with clear skies, moderate winds (19-24 km/h), and temperatures rising to 1.8°C-2.2°C. Best time for running or biking.</p>\n    <p><strong>Evening (5-8 PM):</strong> Gradual cooling and increasing cloud cover, but still suitable for light outdoor activities. Wind chill remains a factor.</p>\n\n    <p style=\"font-style: italic; margin-top: 10px;\">Note: Strong winds and cold apparent temperatures may require layered clothing for extended outdoor exposure.</p>\n</div>",
  "german": "<div style=\"font-family: Arial, sans-serif; line-height: 1.5; max-width: 600px; margin: 0 auto; padding: 15px; background-color: #f9f9f9; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1);\">\n    <h2 style=\"color: #333; border-bottom: 1px solid #ddd; padding-bottom: 10px;\">Kledering Wetterbericht - 2025-12-30</h2>\n\n    <p><strong>Temperatur:</strong> Schwankt zwischen -0.9°C und 2.2°C, mit gefühlten Temperaturen bis -7.5°C aufgrund starker Winde. Morgens und abends wird es besonders kalt sein.</p>\n\n    <p><strong>Wind:</strong> Starke westliche Winde mit einer Durchschnittsgeschwindigkeit von 23.3 km/h, mit Böen bis zu 54 km/h. Der Windchill wird die gefühlte Temperatur deutlich beeinflussen, insbesondere in den frühen Morgen- und späten Abendstunden.</p>\n\n    <p><strong>Niederschlag:</strong> Kaum Niederschlag (0.2 mm) erwartet, mit einer kurzen 78%igen Chance auf leichten Regen oder Nieselregen um 7 Uhr. Ansonsten herrschen trockene Bedingungen.</p>\n\n    <p><strong>UV-Index:</strong> Erreicht mittags einen Höchstwert von 1.5, was auf eine niedrige UV-Exposition hinweist. Sonnenschutz ist nicht kritisch, aber Sonnenbrillen können für Outdoor-Aktivitäten nützlich sein.</p>\n\n    <p><strong>Bewölkung:</strong> Bewölkt am frühen Morgen, klart gegen Mittag und bleibt bis zum späten Abend größtenteils klar. Die Sicht bleibt mit durchschnittlich 58.9 km hervorragend.</p>\n\n    <h3 style=\"color: #333; margin-top: 15px;\">Empfehlungen für Outdoor-Aktivitäten</h3>\n    <p><strong>Vormittag (7-9 Uhr):</strong> Ungünstig aufgrund des kalten Windchills (-6.3°C bis -5.0°C) und möglichem leichtem Niederschlag. Vermeiden Sie Outdoor-Sport in diesem Zeitfenster.</p>\n    <p><strong>Nachmittag (12-16 Uhr):</strong> Ideale Bedingungen mit klarem Himmel, mäßigen Winden (19-24 km/h) und Temperaturen von 1.8°C bis 2.2°C. Beste Zeit zum Laufen oder Radfahren.</p>\n    <p><strong>Abend (17-20 Uhr):</strong> Allmähliche Abkühlung und zunehmende Bewölkung, aber noch geeignet für leichte Outdoor-Aktivitäten. Der Windchill bleibt ein Faktor.</p>\n\n    <p style=\"font-style: italic; margin-top: 10px;\">Hinweis: Starke Winde und kalte gefühlte Temperaturen können mehrschichtige Kleidung für längere Aufenthalte im Freien erforderlich machen.</p>\n</div>"
}